fabrika/src/InformationRegisters/ДДС/ДДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДДС</name>
  <comment>Хранит данные по ДДС холдинга</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СконвертированнаяСумма</name>
    <comment>Сумма после конвертации</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДеньВДень</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>НомерВБухгалтерии</name>
    <type>
      <types>DocumentRef.ТаможняРассчёты</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоступления</name>
    <comment>Плановая дата прихода</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Комментарий</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>105</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ТипОрганизации</name>
    <type>
      <types>EnumRef.ТипОрганизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДвижения</name>
    <type>
      <types>EnumRef.ТипДвиженияДДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>String</types>
      <types>CatalogRef.ПолучателиДДС</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетОрганизации</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетКонтрагента</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорыКонтрагентов</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерПлатежа</name>
    <type>
      <types>DocumentRef.ТаможняРассчёты</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fabrika/src/InformationRegisters/ДДС/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    
    //Установим параметры отчёта
    Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", НачалоДня(ТекущаяДата()));
    
    
    
	Если ЗначениеЗаполнено(Параметры.Расшифровка) Тогда
		
		Отбор = Список.Отбор;
		ПолучитьСписокОрганизаций(Параметры.Расшифровка.РасшифровкаМассив, Отбор, Параметры.Расшифровка.ДанныеРасшифровки);		
   		
	КонецЕсли;	
	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ПолучитьСписокОрганизаций(МассивРасшифровок, Отбор, ДанныеРасшифровки, ДобавитьОрганизации = ЛОЖЬ)
	
	СтруктураРасшифровки = ОбщийМодульСервер.ПолучениеРасшифровкиВСтруктуру(МассивРасшифровок[0], ДанныеРасшифровки, Новый Структура);
    
    
    Если СтруктураРасшифровки.Свойство("ТипДвижения") Тогда
		ТипДвижения = Строка(СтруктураРасшифровки.ТипДвижения);
    Иначе
        ТипДвижения = "Списание";
    КонецЕсли;    
 
	
    Если СтруктураРасшифровки.Свойство("Период") Тогда
        //
        Группа = Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
        Группа.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;    
        Группа.Использование = Истина;
        //        
        ДобавитьЭлементОтбора(Группа, "Период", СтруктураРасшифровки.Период);
        ДобавитьЭлементОтбора(Группа, "ДатаПоступления", СтруктураРасшифровки.Период);
        //
    КонецЕсли;
    
    
    Если СтруктураРасшифровки.Свойство("Организация") Тогда
        Поле = ?(ТипДвижения = "Списание", "Организация", "Получатель.ИНН");
        Значение = ?(ТипДвижения = "Списание", СтруктураРасшифровки.Организация, СтруктураРасшифровки.Организация.ИНН);
        //
		ДобавитьЭлементОтбора(Отбор, Поле, Значение);
	КонецЕсли;	
    
    
    Если СтруктураРасшифровки.Свойство("Получатель") Тогда
        Поле = ?(ТипДвижения = "Списание", "Получатель", "Организация.ИНН");
        Значение = ?(ТипДвижения = "Списание", СтруктураРасшифровки.Получатель, СтруктураРасшифровки.Получатель.ИНН);
        //
		ДобавитьЭлементОтбора(Отбор, Поле, Значение); 	
	КонецЕсли;	

		
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ДобавитьЭлементОтбора(Отбор, ЛевоеЗначение, ПравоеЗначение)
    
    
    ЭлементОтбора = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ЭлементОтбора.ПравоеЗначение = ПравоеЗначение;
    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ЛевоеЗначение);
    ЭлементОтбора.Использование = Истина;      
   

КонецПроцедуры
